Ran Plan for project: `terraform-github` dir: `.` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # module.repositories.module.terraform_discord.github_branch_protection.default will be created
+ resource "github_branch_protection" "default" {
+       allows_deletions                = false
+       allows_force_pushes             = false
+       blocks_creations                = false
+       enforce_admins                  = true
+       id                              = (known after apply)
+       lock_branch                     = false
+       pattern                         = "main"
+       repository_id                   = "terraform-discord"
+       require_conversation_resolution = true
+       require_signed_commits          = true
+       required_linear_history         = false

+       required_status_checks {
+           strict = true
        }
    }

  # module.repositories.module.terraform_discord.github_repository_webhook.atlantis will be created
+ resource "github_repository_webhook" "atlantis" {
+       active     = true
+       etag       = (known after apply)
+       events     = [
+           "issue_comment",
+           "pull_request",
+           "pull_request_review",
+           "push",
        ]
+       id         = (known after apply)
+       repository = "terraform-discord"
+       url        = (known after apply)

+       configuration {
+           content_type = "json"
+           insecure_ssl = false
+           secret       = (sensitive value)
+           url          = (sensitive value)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p terraform-github`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.techtales.io/lock?id=techtales-io%252Fterraform-github%252F.%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p terraform-github`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`